"use strict"

//З клавіатури вводиться ціна товару і кількість грошей.
//Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші,
//то пропонуємо купити лотерею за 4 грн:

//Просимо користувача ввести перше і друге число


const a = parseFloat(prompt("Введіть ціну товару"))
const b = parseFloat(prompt("Введіть кількість грошей"))
const c = 4

if (b < a) {
	document.write(`У Вас не вистачає коштів...


	
	<div style="color:red;"> Ідіть на курси <a style="color:#036efa;" href="https://edu.fls.guru/js.html"> JS </a> і будете мати грощі</div>`)
}
else if (b >= a) {
	document.write(`
	ВСЕ ОК !

	
	Дякуємо за покупку! &#9996`)

}
let d = b - a
console.log(d);
if (d >= c) {
	document.write(`
	
	
	У Вас вистачає коштів, пропонуємо купити лотерею за ${c}грн   !!!!!!!!!!!!`)
}













