"use strict"
// З клавіатури вводяться імена двох дітей та кількість у них цукерок. 
//Вивести не екран ім’я тієї дитини, у якої кількість цукерок є більшою, або вивести, 
//що кількість однакова:
const a = prompt("Введіть ім_я ПЕРШОЇ дитини")
const b = parseFloat(prompt("Введіть кількість у ПЕРШОЇ дитини цукерок"))
const c = prompt("Введіть ім_я ДРУГОЇ дитини")
const d = parseFloat(prompt("Введіть кількість у ДРУГОЇ дитини цукерок"))

//variable
document.write(`
<div>Iм_я ПЕРШОЇ дитини : ${a}</div>
<div>Kількість у ПЕРШОЇ дитини цукерок : ${b}</div>
<div>Iм_я ДРУГОЇ дитини : ${c}</div>
<div>Kількість у ДРУГОЇ дитини цукерок : ${d}</div>
`);

if (b > d)
	document.write(`

<br><div>У ${a} цукерок більше. </div>
`);

if (b < d)
	document.write(`

<br><div>У ${c} цукерок більше. </div>
`);

if (b === d)
	document.write(`

<br><div style="color:red;">У ${a} i ${c} цукерок однакова. </div>
`);